{
  "general_disclaimer": "IMPORTANT: For chemical treatments, always consult your local Krishi Vigyan Kendra (KVK) or agricultural extension officer to ensure you are using products that are safe, effective, and approved for use in your specific region. Always follow label instructions for application rates and safety precautions.",

  "Apple_Apple_scab": "Management: Rake and destroy fallen leaves in autumn to reduce fungal spores. Prune trees to improve air circulation and sunlight penetration. Chemical Control: Apply fungicides like myclobutanil or captan, starting from early spring before buds open and continuing through the rainy season.",
  "Apple_Black_rot": "Management: Prune out and destroy cankered branches and dead wood during dormancy. Remove and dispose of mummified fruit. Ensure good air circulation around trees. Chemical Control: Fungicide sprays used for apple scab (like captan) can also help manage black rot.",
  "Apple_Cedar_apple_rust": "Management: Remove nearby juniper and red cedar trees if possible, as they are alternate hosts for the rust fungus. Prune out visible galls on apple trees. Chemical Control: Apply preventative fungicides like myclobutanil during the early flowering stages.",
  "Apple_healthy": "The plant appears healthy. Continue to prune annually to maintain an open canopy, monitor for pests, and ensure proper watering and fertilization based on soil tests.",

  "Cherry_(including_sour)_Powdery_mildew": "Management: Prune trees to improve air circulation. Avoid excessive nitrogen fertilization, which promotes susceptible new growth. Chemical Control: Apply sulfur-based or potassium bicarbonate fungicides at the first sign of mildew. Horticultural oils can also be effective.",
  "Cherry_(including_sour)_healthy": "The plant appears healthy. Maintain good orchard hygiene by removing fallen leaves and fruit. Ensure adequate watering, especially during fruit development, and monitor for common pests like aphids.",

  "Corn_(maize)_Cercospora_leaf_spot_Gray_leaf_spot": "Management: Practice crop rotation with non-grass crops and till the soil to bury infected crop residue. Choose resistant hybrid varieties if available. Chemical Control: Apply fungicides containing pyraclostrobin or azoxystrobin if the disease is severe, especially during the tasseling and silking stages.",
  "Corn_(maize)_Common_rust_": "Management: Most modern corn hybrids have good resistance. Planting resistant varieties is the most effective strategy. The disease is often cosmetic and may not require treatment unless it appears early and is severe. Chemical Control: Fungicides are typically not economical unless on highly susceptible sweet corn varieties.",
  "Corn_(maize)_Northern_Leaf_Blight": "Management: Choose resistant hybrids. Practice crop rotation and tillage to reduce fungal residue in the soil. Chemical Control: If disease pressure is high, fungicides containing strobilurins or triazoles may be necessary. Apply at the first sign of disease.",
  "Corn_(maize)_healthy": "The plant appears healthy. Ensure proper nutrient management, particularly nitrogen, and maintain adequate soil moisture. Scout fields regularly to catch any issues early.",

  "Grape_Black_rot": "Management: Prune vines during dormancy and destroy the cuttings. Remove and destroy any mummified grapes. Improve air circulation. Chemical Control: Apply preventative fungicides like Mancozeb or myclobutanil, starting when new shoots are 2-4 inches long and continuing until the grapes begin to ripen.",
  "Grape_Esca_(Black_Measles)": "Management: This is a complex trunk disease. There is no effective chemical cure. Prune out and destroy infected or dead wood well below the symptomatic area. Manage vine stress with proper irrigation and nutrition.",
  "Grape_Leaf_blight_(Isariopsis_Leaf_Spot)": "Management: Improve air circulation through proper pruning and canopy management. Rake and destroy fallen leaves. Chemical Control: Fungicide programs for black rot will typically also control leaf blight.",
  "Grape_healthy": "The plant appears healthy. Continue with a regular pruning and spray schedule as recommended for your region. Monitor for common pests like leafhoppers and manage canopy density for optimal sun exposure.",

  "Orange_Haunglongbing_(Citrus_greening)": "Management: This disease is spread by the Asian Citrus Psyllid. There is NO CURE. The primary strategy is prevention. Remove and destroy infected trees immediately to prevent spread. Control the psyllid insect with horticultural oils and targeted insecticides. Use only certified disease-free trees for new plantings.",

  "Pepper,_bell_Bacterial_spot": "Management: Use certified disease-free seeds and transplants. Practice crop rotation, avoiding fields where tomatoes or peppers were recently grown. Avoid overhead watering. Chemical Control: Apply preventative sprays of copper-based bactericides. These are most effective before the disease becomes widespread.",
  "Pepper,_bell_healthy": "The plant appears healthy. Mulch around the base of the plant to conserve moisture and prevent soil-borne diseases. Provide consistent water and fertilize as needed, especially during flowering and fruiting.",

  "Potato_Early_blight": "Management: Use certified disease-free seed potatoes. Practice crop rotation with non-host crops. Remove and destroy infected foliage. Chemical Control: Apply fungicides containing Mancozeb or chlorothalonil. Begin applications when plants are 8-10 inches tall or at the first sign of disease.",
  "Potato_Late_blight": "Management: This is a very serious disease. Destroy all volunteer potato plants and cull piles. Use certified disease-free seed. Ensure good air movement and avoid overhead irrigation. Chemical Control: A strict, preventative fungicide program is essential. Use products containing chlorothalonil, mancozeb, or more targeted systemic fungicides based on local recommendations.",
  "Potato_healthy": "The plant appears healthy. Ensure consistent hilling of soil around the plants to protect tubers from sunlight and pests. Monitor soil moisture and watch for signs of nutrient deficiencies.",

  "Strawberry_Leaf_scorch": "Management: Rake and remove infected leaves after harvest to reduce overwintering fungus. Plant in well-drained soil and avoid dense plantings to promote air circulation. Chemical Control: Fungicide applications are often not necessary unless the disease is severe. If needed, sprays used for other fungal diseases can be effective.",
  "Strawberry_healthy": "The plant appears healthy. Renovate strawberry beds after harvest. Maintain a consistent watering schedule and use straw mulch to keep fruit clean and suppress weeds. Monitor for pests like spider mites.",

  "Tomato_Bacterial_spot": "Management: Use disease-free seeds. Practice a 3-year crop rotation away from peppers and tomatoes. Mulch plants to reduce water splash. Avoid working with plants when they are wet. Chemical Control: Apply copper-based fungicides as a preventative measure. Efficacy can be limited once the disease is established.",
  "Tomato_Early_blight": "Management: Remove and destroy lower infected leaves. Use mulch to prevent soil splash and practice crop rotation. Chemical Control: Apply fungicides containing Mancozeb, Chlorothalonil, or copper. Always follow local agricultural guidelines for chemical use.",
  "Tomato_Late_blight": "Management: This is a serious, fast-spreading disease. Remove and destroy infected plants immediately. Ensure wide spacing for air circulation. Avoid overhead watering. Chemical Control: A preventative spray program with fungicides like chlorothalonil or copper is critical, especially during cool, moist weather.",
  "Tomato_Leaf_Mold": "Management: Primarily a greenhouse issue. Improve air circulation and reduce humidity by venting. Prune lower leaves. Avoid overhead watering. Choose resistant varieties. Chemical Control: Fungicides can be used but are less effective than environmental control.",
  "Tomato_Septoria_leaf_spot": "Management: Remove and destroy infected lower leaves. Use mulch to reduce soil splash. Practice crop rotation. Chemical Control: Use fungicides containing chlorothalonil or mancozeb. Begin applications at the first sign of disease on lower leaves.",
  "Tomato_Spider_mites_Two-spotted_spider_mite": "Management: This is a pest, not a disease. Spray plants with a strong jet of water to dislodge mites. Use insecticidal soaps or horticultural oils. Encourage natural predators like ladybugs. Chemical Control: Use a miticide if infestations are severe, rotating products to prevent resistance.",
  "Tomato_Target_Spot": "Management: Improve air circulation by pruning and spacing plants correctly. Practice crop rotation. Remove heavily infected plant debris. Chemical Control: Fungicides used for Early Blight (Mancozeb, chlorothalonil) are also effective against Target Spot.",
  "Tomato_Yellow_Leaf_Curl_Virus": "Management: This is a virus spread by whiteflies. There is NO CURE. Control whitefly populations using yellow sticky traps and insecticides. Remove and destroy infected plants immediately to prevent spread. Use reflective mulch to deter whiteflies.",
  "Tomato_mosaic_virus": "Management: There is NO CURE for this virus. Remove and destroy infected plants. Control aphids, which can spread the virus. Wash hands and tools thoroughly after handling infected plants to prevent mechanical spread.",
  "Tomato_healthy": "The plant appears healthy. Maintain consistent watering, ensure balanced fertilization, and continue to monitor for pests and diseases. Good air circulation and pruning lower leaves can help prevent future issues."
}